In [1]:
import pandas as pd

In [2]:
#creating dataset

data = {
    "ID": [1,2,3,4,3],
    "Name": ["Ravi","Neha","Ravi","Arjun","Ravi"],
    "Age": [25,28,25,30,25],
    "City": ["Delhi","Mumbai","Delhi","Pune","Delhi"]
}
df = pd.DataFrame(data)
df

   ID   Name  Age    City
0   1   Ravi   25   Delhi
1   2   Neha   28  Mumbai
2   3   Ravi   25   Delhi
3   4  Arjun   30    Pune
4   3   Ravi   25   Delhi

In [10]:
# Detecting duplicate records in dataset
print("Duplicated Rows")
print(df.duplicated())     #return True for the repeated row

print("Total number of duplicate records : ",end = "")
print(df.duplicated().sum())

Duplicated Rows
0    False
1    False
2    False
3    False
4     True
dtype: bool
Total number of duplicate records : 1

In [12]:
#Only Checks 'Name' column for detecting duplicate records in data
print(df.duplicated(subset = ["Name"]))

0    False
1    False
2     True
3    False
4     True
dtype: bool

#### Deleting duplicates

In [ ]:
#only keeping first occurence

df_new = df.drop_duplicates()
df_new

   ID   Name  Age    City
0   1   Ravi   25   Delhi
1   2   Neha   28  Mumbai
2   3   Ravi   25   Delhi
3   4  Arjun   30    Pune

In [17]:
# only keeping last occurence

df_new2 = df.drop_duplicates(keep = "last")
df_new2

   ID   Name  Age    City
0   1   Ravi   25   Delhi
1   2   Neha   28  Mumbai
3   4  Arjun   30    Pune
4   3   Ravi   25   Delhi

In [ ]:
# only keeping non repeating records

df_new3 = df.drop_duplicates(keep = False)    #remove both repeating rows 
df_new3

   ID   Name  Age    City
0   1   Ravi   25   Delhi
1   2   Neha   28  Mumbai
3   4  Arjun   30    Pune

In [ ]:
# keeping only unique records
#deletes the last occurence of duplicate record

df_uni = df[~df.duplicated()]
df_uni

   ID   Name  Age    City
0   1   Ravi   25   Delhi
1   2   Neha   28  Mumbai
2   3   Ravi   25   Delhi
3   4  Arjun   30    Pune